/***********************************************
程序功能：实现4个流水灯同时闪烁
------------------------------------------------
测试说明：观察流水灯流动顺序和速度的变化
************************************************/
#include  <msp430x14x.h>

void delay(unsigned int cnt) //简单的延时
{
 while(--cnt);
}
/****************主函数****************/
void main(void)
{
  
    WDTCTL = WDTPW + WDTHOLD;       //关闭看门狗
    P2DIR = 0xff;                   //设置P2口方向为输出
    P2OUT = 0xff;                   //设置P2口输出高电平
 while(1)
 {
   P2OUT=0x0;//点亮LED
   delay(30000);//延时
   P2OUT=0xff;//熄灭LED
   delay(30000);//延时
 }

}
