#include "time.h"

/*******************************************
函数名称：Set_Timer
功    能：//启动定时器
参    数：无
返回值  ：无
********************************************/
void Set_Timer()
{ 
  TA1CTL = TASSEL_2 + MC_2 + TACLR;         // SMCLK, Continous up, clear TAR
  TA1EX0 |= TAIDEX_2;                       // 对SMCK8分频后再进行3分频，然后作为TACLK使用，总共为24分频得到1Mhz
}

/*******************************************
函数名称：Set_Timer_B0
功    能：//启动定时器
参    数：无
返回值  ：无
********************************************/
void Stop_Timer()
{ 
  TA1CTL |= MC_0;
}
