/******************************************************************************
	            MSP430F5438A Taurus Ver4.2

功能：测试MSP430F5438A实时时钟DS1302，初始化DS1302时间，然后将实时时间输出到串口

硬件原理图：  DS1302_SCLK --> P7.5       
              DS1302_IO   --> P7.6
              DS1302_RST  --> P7.7

测试工具：串口助手
操作方法：
1.将P34--RXD; P35--TXD用跳线帽短接
2.程序下载以后，打开串口助手，波特率设置为9600
3.串口助手上会显示时间信息
中景园电子
淘宝连接：https://shop73023976.taobao.com
******************************************************************************/

#include "main.h"

unsigned char time_buf1[8] = {0x20,0x15,0x04,0x20,0x12,0x12,0x30,0x6};  //初始化时间：空年月日时分秒周

void main()
{
  Init_System();                        //初始化系统 

  Ds1302_Write_Time();                  //初始化时间
//  Delay_ms(1000);
  
  UART_SendString("System Start...\r\n");
  
  while(1)
  {
    Send_DS1302();
    Delay_ms(1000);
  }
}